fluid/cases/NASAsc2-0410_pimpleFoam_5deg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-11 -11  0)
    ( 21 -11  0)
    ( 21  11  0)
    (-11  11  0)
    (-11 -11 14.475)
    ( 21 -11 14.475)
    ( 21  11 14.475)
    (-11  11 14.475)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 44 28) simpleGrading (1 1 1)
);

edges
(
);

boundary (

    domainWalls
    {
        type patch;
        faces
        (
	    (1 5 4 0)
	    (3 7 6 2)
	    (4 5 6 7)
        );
    }

    fixedWall
    {
        type wall;
	faces
	(
	    (0 1 2 3)
	);
    }

    inlet
    {
        type patch;
        faces
	(
	    (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
);


// ************************************************************************* //
