fluid/cases/NASAsc2-0410_pimpleFoam_5deg/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Viscosità cinematica (m^2/s)
// Assicurati che ci sia lo spazio tra le dimensioni e il valore
nu              [0 2 -1 0 0 0 0] 1.5e-5;

// Densità fittizia (opzionale, utile per forceCoeffs se lo richiede)
rho             [1 -3 0 0 0 0 0] 1.225;

// ************************************************************************* //